#! /usr/bin/python

# Задача 29-2

# Дана квадратная матрица, напишите функцию, которая возвращает матрицу,
# полученную вращениемпо или против часовой стрелке.

# matrix = [[1, 2, 3],
#           [4, 5, 6],
#           [7, 8, 9]]
# rotate(matrix, "по часовой") # -----> [[7, 4, 1], [8, 5, 2], [9, 6, 3]]

def rotate(m):

    return m


matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
print(rotate(matrix), "по часовой")  # -----> [[7, 4, 1], [8, 5, 2], [9, 6, 3]]
