#! /usr/bin/python

# v1 string
# s = str(input("Введите генетический код: "))
s = 'АГЦТААГГЦЦТТГАГАТЦТТАЦЦТАГТАГЦТ'
# Вывод на экран исходной строки
print(s)
# Поиск в строке АГ и замена на ГА
s = s.replace('АГ', 'ГА')
# Поиск в строке ЦТ и замена на ЦАГТ
s = s.replace('ЦТ', 'ЦАГТ')
# Вывод на экран изменённой строки
print(s)
#----------------------------------------------
print()
# v2 tuple
# s = str(input("Введите генетический код: "))
s = 'АГЦТААГГЦЦТТГАГАТЦТТАЦЦТАГТАГЦТ'
r = [('АГ', 'ГА'), ('ЦТ', 'ЦАГТ')]
# Вывод на экран исходной строки
print(s)
for i in r:
    s = s.replace(i[0], i[1])
print(s)
#----------------------------------------------
print()
# v3 dict
s = 'АГЦТААГГЦЦТТГАГАТЦТТАЦЦТАГТАГЦТ'
r = {'АГ': 'ГА', 'ЦТ': 'ЦАГТ'}
# Вывод на экран исходной строки
print(s)
for k, v in r.items():
    s = s.replace(k, v)
print(s)
