#! /usr/bin/python

# Напишите рекурсивную функцияю,
# которая вычисляет количество
# цифры введенного натурального числа
def col_num(n):
    if n < 10:
        return 1
    else:
        pass
    return


print(col_num(int(input("Enter num: "))))
