#! /usr/bin/python

# Составьте в произвольной форме список полей в таблице Pupil,
# предполагая, что она будет использоваться в системе учета
# и планирования курса «Разработчик на Питоне»

# ID ученика (Pupil ID).
# Фамилия ученика (Last Name).
# Имя ученика (First Name).
# Отчество ученика (Middle Name).
# Дата рождения ученика (Date of Birth).
# Пол ученика (Gender).
# Адрес ученика (Address).
# Телефон ученика (Phone Number).
# Электронная почта ученика (Email).
# Номер группы, в которой учится ученик (Group Number).
# Дата начала обучения (Enrollment Date).
# Дата окончания обучения (Graduation Date).
# Успеваемость ученика (Academic Performance).
# Статус ученика (Status).