#! /usr/bin/python

# Задача 21-1
# Составьте в произвольной форме список полей в таблице Pupil,
# предполагая, что она будет использоваться в системе учета
# и планирования курса «Разработчик на Питоне»

# ID ученика (ID).
# Фамилия ученика (Last Name).
# Имя ученика (First Name).
# Отчество ученика (Middle Name).
# Дата рождения ученика (Date of Birth).
# Пол ученика (Gender).
# Адрес ученика (Address).
# Телефон ученика (Phone Number).
# Электронная почта ученика (Email).
# Дата начала обучения (Enrollment Date).
# Дата окончания обучения (Graduation Date).
# Количество уроков (Number of Lessons)
# Выполненые задания (Completed Tasks).
# Успеваемость ученика (Academic Performance).
