#! /usr/bin/python

# Задача 15-3
# Напишите функцию, которая находит в строке все телефонные номер,
# которые удовлетворяют следущим цаблонамЖ
# +7(812)DDD-DDDD, +7(812)DDD-DD-DD, +7(921)DDD-DDDD, +7(921)DDD-DD-DD
# где D любая цифра

import re

str = "+7(095)118-1920 +7(812)118-12-78 +7(495)183-65-65 " \
      "+7(812)183-6999, +7(927)470-1357, +7(921)499-75-31, " \
      "+7(921)670-3355, +7(921)679-24-68, +7(923)810-2002, " \
      "+7(812)183-69-45, +7(925)470-4567, +7(921)499-33-77, " \
      "+7(921)670-1736, +7(921)679-44-55, +7(937)810-0360"

# print(re.findall(r"\b\+?[7,8](\s*\d{3}\s*\d{3}\s*\d{2}\s*\d{2})\b", str))
print(re.findall(r'\+7\([812,921].*?\).*?\d{3}.*?\d{2}.*?\d{2}', str))


