#! /usr/bin/python

# str1 = input("Введите книг, через запятую 1-го ученика: ")
# str2 = input("Введите книг, через запятую 2-ва ученика: ")
str1 = "Война и мир, Над пропастью во ржи, Мастер и Маргарита, Идиот, Миша и Маша, Один в лесу"
str2 = "Евгений Онегин, Идиот, Мастер и Маргарита, Война и мир, Один в лесу"

s1 = str1.split(sep=", ")
s2 = str2.split(sep=", ")
s3 = {s1: 0 for s1 in s1}
b = 0
for k, v in s3.items():
    if k in s2:
        b += 1
print("Ответ: ", b)
#for i in s2:
#    s3.get(i, lambda: None)()

