#! /usr/bin/python

# Задача 18
# Разработать систему учета решения задач учениками курса «Разработчик на Питоне».
# Проблема. Преподаватель каждый урок задает некоторое количество задач
# в качестве домашнего задания, для упрощения можно считать, что одну.
# Каждый ученик решает каждую задачу. Переводит ее статус в решенную.
# Преподаватель проверяет каждую задачу каждого ученика и либо подтверждает ее
# статус как решенную или меняет ее статус как не решенную.
# Вопрос. Как спроектировать систему классов на Питоне для решения задачи учета.
# Разработайте систему классов (Teacher, Pupil, Lesson, Task. Нужен ли класс Группа)
# Разработайте систему атрибутов для каждого состояния каждого объекта.
# Разработайте систему методов для каждого объекта.
# Отчетность? Запросы? Начните с формулировки решаемой задачи спецификации
# или технического задания. Затем спроектируйте классы, атрибуты, методы.
# Протестируйте систему.