#! /usr/bin/python

# Задача 16-2
# Вводится двухзначное число, например: 45.
# Напишите такой шаблон, чтобы функция re.findall находила только
# те положительные целые числа, которые не больше, чем это введенное число.
# Т.е. для 45 она находила бы 0, 1 , 12 , 45, но не 46, 100, 1000

import re

# num = input("трехзначное число: ")
s = "-25, -15, -10, -5, 0, 1, 5, 8, 12, 25, 31, 43, 56, 62, 74, 87, 91, 100, 234, 345, 555, 765, 1000"
num = "345"
if len(num) == 1:
    st = re.compile(fr"\b[0-{num}]\b")
elif len(num) == 2:
    n1 = num[0]
    n2 = num[1]
    st = re.compile(fr"\b[0-9]\b|\b[1-{n1}][0-{n2}]\b")
elif len(num) == 3:
    n1 = num[0]
    n2 = num[1]
    n3 = num[2]
    st = re.compile(fr"\b[0-9]\b|\b[1-9][0-9]\b|\b[1-{n1}][0-{n2}][0-{n3}]\b")
else:
    st = '0'
print(st)
print(re.findall(st, s))
