#! /usr/bin/python

# Задача 16-2
# Вводится двухзначное число, например: 45.
# Напишите такой шаблон, чтобы функция re.findall находила только
# те положительные целые числа, которые не больше, чем это введенное число.
# Т.е. для 45 она находила бы 0, 1 , 12 , 45, но не 46, 100, 1000

import re

# num = input("Введите число: ")
s = "-25, -15, -10, -5, 0, 1, 5, 8, 12, 25, 31, 43, 56, 62, 74, 87, 91, 100, 234, 345, 555, 765, 1234, 2345, 3456, 5555"
num = "456"
z = "[0-9]"
y = "[1-9]"
a = f"\\b{z}\\b"
b = f"\\b{y}{z}\\b"
c = f"\\b{y}{z}{z}\\b"
if len(num) == 1:
    st = re.compile(fr"\b[0-{num[0]}]\b")
elif len(num) == 2:
    st = re.compile(fr"{a}|\b[1-{num[0]}][0-{num[1]}]\b")
elif len(num) == 3:
    st = re.compile(fr"{a}|{b}|\b[1-{num[0]}][0-{num[1]}][0-{num[2]}]\b")
elif len(num) == 4:
    st = re.compile(fr"{a}|{b}|{c}|\b[1-{num[0]}][0-{num[1]}][0-{num[2]}][0-{num[3]}]\b")
else:
    st = '0'
print(st)
print(re.findall(st, s))
