#! /usr/bin/python

abc = input('Введите пример: ').split()

# Проверка второго элемента списка на знак +
if abc[1] == '+':
    print(abc[0], '+', abc[2], '=', int(abc[0])+int(abc[2]))
# Проверка второго элемента списка на знак -
if abc[1] == '-':
    print(abc[0], '-', abc[2], '=', int(abc[0])-int(abc[2]))
# Проверка второго элемента списка на знак *
if abc[1] == '*':
    print(abc[0], '*', abc[2], '=', int(abc[0])*int(abc[2]))
# Проверка второго элемента списка на знак /
if abc[1] == '/':
    # Прверка третьего элемента списка на 0
    if int(abc[2]) != 0:
        print(abc[0], '/', abc[2], '=', int(abc[0])/int(abc[2]))
    else:
        print("Деление на ноль!")

