#! /usr/bin/python

# Задача 12-3
# Напишите функцию, которая на вход принимает
# строку диапазонов натуральных чисел,
# например: '1-2, 4-4, 3-6'
# На выходе функция должна сформировать список натуральных чисел,
# которые попадают в один из этих диапазонов,
# например: [1,2,4,3,4,5,6]

def str_to_lst(sting):
    return

# s = input("Введите диапозон натуральных чисел: ")
s = '1-2, 4-4, 3-6'
print(s.split(','))
