#! /usr/bin/python

# Задача 21-1
# Составьте в произвольной форме список полей в таблице Pupil,
# предполагая, что она будет использоваться в системе учета
# и планирования курса «Разработчик на Питоне»


# pupil_id - уникальный идентификатор ученика
# first_name - имя ученика
# last_name - фамилия ученика
# middle_name - отчество ученика
# date_of_birth - дата рождения ученика
# age - возраст
# gender - пол ученика
# phone - телефон ученика
# email - электронная почта ученика
# address - адрес ученика
# city - город ученика
# country - страна ученика
# education_level - уровень образования ученика
# course_status - статус курса ученика
# course_start_date - дата начала курса ученика
# course_end_date - дата окончания курса ученика
# course_grade - оценка за курс ученика
# lessons - количество уроков
# lessons_grade - оценка за урок
# tasks - количество заданий
# tasks_grade - оценка за задания
# payment_status - статус оплаты курса ученика
# payment_amount - сумма оплаты курса ученика
