#! /usr/bin/python

# Создайте класс Shape, объекты которого имеют атрибуты Colour -
# строка, например, "Красный", "Синий"; Square - площадь объекта
# Создайте несколько методов:
# 1. Установить цвет объекта
# 2. Запросить цвет объекта и напечатать его
# 3. Задать площадь объекта
# 4. Запросить площадь объекта

class Shape:
    @classmethod
    def __init__(self, colour, square):
        self.colour = colour
        self.square = square

    def instsl_c(self, c):
        pass

    def get_c_print(self, c):
        pass

    def instal_s(self, s):
        pass

    def get_square(self, s):
        pass


