#! /usr/bin/python

# Задача 20-1
# Человек приходит в кафе выпить чашку кофе.
# Напишите текстом, какие методы было бы здорово реализовать
# для класса Посетитель кафе.

# Для класса CafeVisitor можно использовать методы, например:
# "Заказать кофе", который принимает параметры, такие как тип кофе, количество сахара,
#  количество молока или сливок и т.д., и добавляет заказ в список заказов текущего посетителя.
# "Полчить список заказов", который возвращает список заказов текущего посетителя.
# "Получить счет", который выводит на экран общую сумму заказа.
# "Оплатить заказ", который считает общую сумму заказа и выводит на экран, и затем принимает платеж.
# "Отменить заказ", который принимает параметр - номер заказа, и удаляет его из списка заказов.
# "Изменить заказ", который принимает параметры - номер заказа и новые значения параметров кофе,
#  и изменяет соответствующий заказ в списке заказов текущего посетителя.

